Revit 2024 API
ColorWithTransparency.SetGreen Method
 set green
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public void SetGreen(
	uint green
)
Visual Basic
Public Sub SetGreen ( _
	green As UInteger _
)
Visual C++
public:
void SetGreen(
	unsigned int green
)
Parameters
green
Type: System.UInt32
 green
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The value is not valid. The valid range is 0 to 255.
See Also
ColorWithTransparency Class
Autodesk.Revit.DB Namespace